# **Biblioteca**

In [3]:
%pip install pymysql sqlalchemy

Requirement already satisfied: pymysql in c:\users\samsung\appdata\local\programs\python\python312\lib\site-packages (1.1.1)
Requirement already satisfied: sqlalchemy in c:\users\samsung\appdata\local\programs\python\python312\lib\site-packages (2.0.31)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\samsung\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\samsung\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy) (3.0.3)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [4]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine

# **Dados**
Aqui, vamos importar nossos dados sintéticos gerados para prepará-los para inserção.

In [8]:
hospital = pd.read_csv("../datas/mysql/Hospitais.csv")
hospital.head()

,CNPJ,nome,cidade,CEP,endereco
0,40.678.125/0001-90,Cirino - EI,Mendonça,69366727,Distrito de Macedo\r\nFlavio De Oliveira\r\n93...
1,56.807.243/0001-90,Correia Ferreira S.A.,Siqueira,67561478,"Vereda das Neves, 1\r\nDom Cabral\r\n18906-865..."
2,84.105.937/0001-11,Cavalcante - EI,da Paz,43829764,"Via de Araújo, 65\r\nSão Francisco Das Chagas\..."
3,58.143.920/0001-49,Cardoso Oliveira - EI,Costa,21114341,"Distrito Yasmin Sampaio, 31\r\nFloresta\r\n812..."
4,40.392.758/0001-37,das Neves,Fonseca,20995635,"Feira Almeida, 6\r\nVila Copacabana\r\n20662-6..."

In [7]:
paciente = pd.read_csv("../datas/mysql/Pacientes.csv")
paciente.head()

,CPF,nome,data_nascimento,telefone,endereco,plano
0,325.894.716-37,Gael da Costa,1931-09-08,+55 54 91950-1181,"Lago Luiz Gustavo Nunes, 34\r\nConjunto Jatoba...",Bradesco Saude
1,041.985.732-04,Eduardo Sales,1927-04-08,+55 83 91948-3693,"Jardim de Gonçalves, 90\r\nSanto André\r\n5129...",Bradesco Saude
2,051.387.692-86,Manuela Mendes,1982-01-25,+55 42 91973-5813,"Chácara Freitas, 4\r\nCoqueiros\r\n18613-593 C...",Sul America
3,574.201.863-08,Bruno Alves,1956-07-15,+55 31 91923-9299,"Fazenda Pastor, 8\r\nVista Alegre\r\n70278-795...",Bradesco Saude
4,249.703.651-99,Diogo Lima,1962-04-15,+55 43 91951-2842,Vila de Gonçalves\r\nConjunto Paulo Vi\r\n7201...,Bradesco Saude

In [9]:
medico = pd.read_csv("../datas/mysql/Medicos.csv")
medico.head()

,CRM,nome,CPF,especialidade,telefone,email
0,5757738,Valentina Carvalho,752.860.391-03,Ginecologia,+55 31 91999-9829,wmacedo@example.com
1,1650946,Fernando Machado,293.745.018-05,Cardiologia,+55 82 91915-0831,isaquepeixoto@example.com
2,1396254,Thiago Carvalho,184.952.603-60,Ginecologia,+55 48 91994-3428,mouradavi-lucca@example.net
3,5122239,Yuri Sampaio,613.059.847-57,Obstetricia,+55 31 91951-4680,vgoncalves@example.com
4,3960525,Luiz Miguel Câmara,734.268.051-62,Obstetricia,+55 37 91980-2350,lpacheco@example.org

In [11]:
disponibilidade = pd.read_csv("../datas/mysql/Disponibilidades.csv")
disponibilidade.head()

   id_medico         id_hospital dia_semana hr_inicio    hr_fim
0    5757738  42.716.935/0001-19    segunda  16:00:00  17:00:00
1    5757738  49.170.538/0001-33    domingo  11:00:00  12:00:00
2    5757738  49.170.538/0001-33      terca  14:00:00  15:00:00
3    5757738  49.170.538/0001-33    domingo  08:00:00  09:00:00
4    5757738  49.170.538/0001-33      sexta  17:00:00  18:00:00

In [12]:
consulta = pd.read_csv("../datas/mysql/Consultas.csv")
consulta.head()

,id_medico,id_hospital,id_paciente,data_consulta,hora,consulta_status
0,6566643,56.807.243/0001-90,357.812.064-26,2024-10-11,09:00:00,agendada
1,5757738,40.678.125/0001-90,546.381.279-91,2024-10-16,15:00:00,agendada
2,8001092,60.951.748/0001-00,129.457.038-23,2024-06-16,09:00:00,realizada
3,8509065,60.951.748/0001-00,710.524.986-20,2024-11-01,10:00:00,agendada
4,8001092,58.143.920/0001-49,741.302.658-90,2024-07-07,16:00:00,realizada

In [15]:
trabalha = pd.read_csv("../datas/mysql/Trabalha.csv")
trabalha.head()

   id_medico         id_hospital
0    5757738  42.716.935/0001-19
1    5757738  49.170.538/0001-33
2    5757738  42.716.935/0001-19
3    1650946  40.392.758/0001-37
4    1396254  56.807.243/0001-90

# **Inserção**
Aqui, vamos criar um conexão com o GCP e fazer a inserção dos csv's nas tabelas criadas na instância o MySQL.

In [16]:
db_host = '34.133.195.112'
db_user = 'ojoaovborges'
db_password = '2702291504'
db_name = 'Julia'

In [17]:
conn = create_engine(f'mysql+pymysql://{db_user}:{db_password}@{db_host}/{db_name}')

In [18]:
hospital.to_sql(con=conn, name='Hospital', if_exists='append', index=False)

10

In [19]:
paciente.to_sql(con=conn, name='Paciente', if_exists='append', index=False)

50

In [20]:
medico.to_sql(con=conn, name='Medico', if_exists='append', index=False)

20

In [21]:
disponibilidade.to_sql(con=conn, name='Disponibilidade', if_exists='append', index=False)

133

In [22]:
consulta.to_sql(con=conn, name='Consulta', if_exists='append', index=False)

100

In [23]:
trabalha.to_sql(con=conn, name='Trabalha', if_exists='append', index=False)

38